posts/2015-09-18-the-planted-church.org
#+date: <2015-09-18>
#+filetags: prayer religion
#+title: The Planted Church

Gracious God, Giver of life,

Long ago,\\
a tree was planted by your grace\\
and watered by your providential care.

It was robbed of\\
life and beauty,\\
and used to fashion a cross\\
to bear body of the Christ,\\
broken for our redemption.

And so, Lord, like that tree,\\
we have been planted,\\
watered, and have grown,\\
yet the time has come for us\\
to offer our lives to you,\\
not just to bear,\\
but to become\\
the body of Christ\\
in this world.

/Amen/
