docs/posts/2015-09-18-the-planted-church.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Planted Church</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Planted Church</h1>
<p class="subtitle" role="doc-subtitle">Sep 18, 2015</p>
</header><p>
Gracious God, Giver of life,
</p>

<p>
Long ago,<br>
a tree was planted by your grace<br>
and watered by your providential care.
</p>

<p>
It was robbed of<br>
life and beauty,<br>
and used to fashion a cross<br>
to bear body of the Christ,<br>
broken for our redemption.
</p>

<p>
And so, Lord, like that tree,<br>
we have been planted,<br>
watered, and have grown,<br>
yet the time has come for us<br>
to offer our lives to you,<br>
not just to bear,<br>
but to become<br>
the body of Christ<br>
in this world.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org40f572b">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
